Revit 2024 API
GeometryInstance Members
The GeometryInstance type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
GetDocument
Gets the document that contains the symbol of this instance.
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetInstanceGeometry()
Computes the geometric representation of the instance.
GetInstanceGeometry(Transform)
Computes a transformation of the geometric representation of the instance.
GetSymbolGeometry()
Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform)
Computes a transformation of the geometric representation of the symbol which generates this instance.
GetSymbolGeometryId
Gets the SymbolGeometryId that contains data about the symbol of this instance.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
Id
A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
 (Inherited from GeometryObject.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
SymbolGeometry
The geometric representation of the symbol which generates this instance.
Transform
The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace